benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-run5.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread calibration: mean lat.: 1.274ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  674.20us   3.48ms   66.95%
    Req/Sec    66.87k     6.27k   81.78k    62.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.18ms
 75.000%    1.71ms
 90.000%    2.28ms
 99.000%    2.96ms
 99.900%    3.27ms
 99.990%    3.40ms
 99.999%    3.44ms
100.000%    3.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.493     0.100000       125688         1.11
       0.654     0.200000       250963         1.25
       0.807     0.300000       375734         1.43
       0.977     0.400000       500803         1.67
       1.176     0.500000       626004         2.00
       1.282     0.550000       688781         2.22
       1.386     0.600000       751636         2.50
       1.489     0.650000       813719         2.86
       1.597     0.700000       876760         3.33
       1.708     0.750000       939293         4.00
       1.768     0.775000       970408         4.44
       1.835     0.800000      1001509         5.00
       1.917     0.825000      1032862         5.71
       2.019     0.850000      1064241         6.67
       2.141     0.875000      1095855         8.00
       2.205     0.887500      1111067         8.89
       2.277     0.900000      1126918        10.00
       2.353     0.912500      1142690        11.43
       2.429     0.925000      1158340        13.33
       2.507     0.937500      1173836        16.00
       2.549     0.943750      1181788        17.78
       2.589     0.950000      1189320        20.00
       2.633     0.956250      1197378        22.86
       2.677     0.962500      1205057        26.67
       2.725     0.968750      1212750        32.00
       2.753     0.971875      1216717        35.56
       2.783     0.975000      1220696        40.00
       2.815     0.978125      1224685        45.71
       2.847     0.981250      1228475        53.33
       2.883     0.984375      1232338        64.00
       2.903     0.985938      1234286        71.11
       2.925     0.987500      1236332        80.00
       2.949     0.989062      1238334        91.43
       2.973     0.990625      1240155       106.67
       3.003     0.992188      1242181       128.00
       3.019     0.992969      1243116       142.22
       3.039     0.993750      1244122       160.00
       3.061     0.994531      1245099       182.86
       3.087     0.995313      1246051       213.33
       3.115     0.996094      1247021       256.00
       3.129     0.996484      1247482       284.44
       3.145     0.996875      1247986       320.00
       3.163     0.997266      1248464       365.71
       3.183     0.997656      1248974       426.67
       3.203     0.998047      1249460       512.00
       3.213     0.998242      1249673       568.89
       3.227     0.998437      1249940       640.00
       3.241     0.998633      1250176       731.43
       3.255     0.998828      1250429       853.33
       3.267     0.999023      1250672      1024.00
       3.275     0.999121      1250796      1137.78
       3.283     0.999219      1250897      1280.00
       3.293     0.999316      1251027      1462.86
       3.303     0.999414      1251147      1706.67
       3.313     0.999512      1251263      2048.00
       3.321     0.999561      1251328      2275.56
       3.329     0.999609      1251381      2560.00
       3.337     0.999658      1251443      2925.71
       3.347     0.999707      1251511      3413.33
       3.359     0.999756      1251576      4096.00
       3.363     0.999780      1251598      4551.11
       3.369     0.999805      1251636      5120.00
       3.375     0.999829      1251659      5851.43
       3.383     0.999854      1251689      6826.67
       3.391     0.999878      1251720      8192.00
       3.395     0.999890      1251736      9102.22
       3.399     0.999902      1251753     10240.00
       3.403     0.999915      1251769     11702.86
       3.405     0.999927      1251778     13653.33
       3.411     0.999939      1251800     16384.00
       3.413     0.999945      1251805     18204.44
       3.415     0.999951      1251812     20480.00
       3.417     0.999957      1251817     23405.71
       3.421     0.999963      1251825     27306.67
       3.423     0.999969      1251831     32768.00
       3.427     0.999973      1251835     36408.89
       3.431     0.999976      1251840     40960.00
       3.435     0.999979      1251847     46811.43
       3.435     0.999982      1251847     54613.33
       3.437     0.999985      1251852     65536.00
       3.437     0.999986      1251852     72817.78
       3.439     0.999988      1251854     81920.00
       3.445     0.999989      1251857     93622.86
       3.447     0.999991      1251859    109226.67
       3.451     0.999992      1251862    131072.00
       3.451     0.999993      1251862    145635.56
       3.451     0.999994      1251862    163840.00
       3.453     0.999995      1251863    187245.71
       3.455     0.999995      1251864    218453.33
       3.459     0.999996      1251866    262144.00
       3.459     0.999997      1251866    291271.11
       3.459     0.999997      1251866    327680.00
       3.459     0.999997      1251866    374491.43
       3.467     0.999998      1251867    436906.67
       3.467     0.999998      1251867    524288.00
       3.467     0.999998      1251867    582542.22
       3.477     0.999998      1251868    655360.00
       3.477     0.999999      1251868    748982.86
       3.477     0.999999      1251868    873813.33
       3.477     0.999999      1251868   1048576.00
       3.477     0.999999      1251868   1165084.44
       3.479     0.999999      1251869   1310720.00
       3.479     1.000000      1251869          inf
#[Mean    =        1.277, StdDeviation   =        0.674]
#[Max     =        3.478, Total count    =      1251869]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1898281 requests in 30.00s, 211.81MB read
Requests/sec:  63275.72
Transfer/sec:      7.06MB