benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-settle.txt
Running 5s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  475.68us   3.10ms   62.49%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.46ms
 90.000%    1.72ms
 99.000%    2.07ms
 99.900%    2.52ms
 99.990%    2.76ms
 99.999%    3.01ms
100.000%    3.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.099     0.000000            1         1.00
       0.454     0.100000         8007         1.11
       0.617     0.200000        16036         1.25
       0.772     0.300000        24007         1.43
       0.925     0.400000        32037         1.67
       1.083     0.500000        40047         2.00
       1.162     0.550000        44037         2.22
       1.236     0.600000        48005         2.50
       1.312     0.650000        52039         2.86
       1.386     0.700000        56046         3.33
       1.456     0.750000        60013         4.00
       1.493     0.775000        62036         4.44
       1.530     0.800000        64005         5.00
       1.572     0.825000        66018         5.71
       1.614     0.850000        67999         6.67
       1.662     0.875000        70033         8.00
       1.687     0.887500        71026         8.89
       1.715     0.900000        72008        10.00
       1.745     0.912500        73021        11.43
       1.779     0.925000        74013        13.33
       1.817     0.937500        75005        16.00
       1.839     0.943750        75514        17.78
       1.862     0.950000        76005        20.00
       1.889     0.956250        76509        22.86
       1.914     0.962500        77014        26.67
       1.940     0.968750        77509        32.00
       1.953     0.971875        77750        35.56
       1.968     0.975000        78017        40.00
       1.980     0.978125        78250        45.71
       1.997     0.981250        78500        53.33
       2.016     0.984375        78748        64.00
       2.028     0.985938        78879        71.11
       2.039     0.987500        78999        80.00
       2.055     0.989062        79125        91.43
       2.077     0.990625        79249       106.67
       2.101     0.992188        79371       128.00
       2.125     0.992969        79435       142.22
       2.149     0.993750        79496       160.00
       2.179     0.994531        79558       182.86
       2.215     0.995313        79621       213.33
       2.247     0.996094        79687       256.00
       2.271     0.996484        79716       284.44
       2.297     0.996875        79746       320.00
       2.331     0.997266        79777       365.71
       2.365     0.997656        79809       426.67
       2.403     0.998047        79839       512.00
       2.429     0.998242        79855       568.89
       2.455     0.998437        79871       640.00
       2.477     0.998633        79886       731.43
       2.497     0.998828        79903       853.33
       2.519     0.999023        79918      1024.00
       2.539     0.999121        79925      1137.78
       2.559     0.999219        79933      1280.00
       2.587     0.999316        79941      1462.86
       2.607     0.999414        79949      1706.67
       2.623     0.999512        79956      2048.00
       2.655     0.999561        79960      2275.56
       2.667     0.999609        79964      2560.00
       2.677     0.999658        79968      2925.71
       2.691     0.999707        79972      3413.33
       2.703     0.999756        79976      4096.00
       2.707     0.999780        79979      4551.11
       2.711     0.999805        79980      5120.00
       2.727     0.999829        79983      5851.43
       2.731     0.999854        79984      6826.67
       2.751     0.999878        79986      8192.00
       2.763     0.999890        79987      9102.22
       2.795     0.999902        79988     10240.00
       2.799     0.999915        79989     11702.86
       2.807     0.999927        79990     13653.33
       2.821     0.999939        79991     16384.00
       2.821     0.999945        79991     18204.44
       2.881     0.999951        79992     20480.00
       2.881     0.999957        79992     23405.71
       2.943     0.999963        79993     27306.67
       2.943     0.999969        79993     32768.00
       2.943     0.999973        79993     36408.89
       3.007     0.999976        79994     40960.00
       3.007     0.999979        79994     46811.43
       3.007     0.999982        79994     54613.33
       3.007     0.999985        79994     65536.00
       3.007     0.999986        79994     72817.78
       3.105     0.999988        79995     81920.00
       3.105     1.000000        79995          inf
#[Mean    =        1.086, StdDeviation   =        0.476]
#[Max     =        3.104, Total count    =        79995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  79996 requests in 5.00s, 8.93MB read
Requests/sec:  15999.08
Transfer/sec:      1.79MB